moneybackend/1c/Documents/Автоплатежи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>Автоплатежи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетРасходы</xr:Item>
				<xr:Item>AccumulationRegister.ДвиженияДС</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КошелекКуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КошелекОткуда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПеревод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолвоМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>График</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

moneybackend/1c/Documents/Автоплатежи/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьГрафик();	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьГрафик()
	Объект.График.Очистить();
	Если ЗначениеЗаполнено(СуммаЕжемесячногоПлатежа) Тогда
		Для НомерМесяца=0 По Объект.КолВоМесяцев-1 Цикл
			Строка			= Объект.График.Добавить();
			Строка.Период	= ДобавитьМесяц(Объект.ДатаНачала,НомерМесяца);
			Строка.Сумма	= СуммаЕжемесячногоПлатежа;
		КонецЦикла; 		
		Объект.Сумма = Объект.График.Итог("Сумма");
	Иначе 		
		Если БезОкругления Тогда
			ЕжемесячнаяСумма = Объект.Сумма/Объект.КолвоМесяцев;
		Иначе 
			ЕжемесячнаяСумма = Окр(Объект.Сумма/Объект.КолвоМесяцев,-3);
			Если ЕжемесячнаяСумма = 0  Тогда
				ЕжемесячнаяСумма = Окр(Объект.Сумма/Объект.КолвоМесяцев,-2);
				Если ЕжемесячнаяСумма = 0  Тогда
					Сообщение = Новый СообщениеПользователю;
					Сообщение.Текст = "Ежемесячный платеж меньше 100 руб.";
					//Сообщение.Поле = "Сумма"; //имя реквизита 
					//Сообщение.УстановитьДанные(); //Ссылка на объект ИБ
					Сообщение.Сообщить();
					Возврат
				КонецЕсли;
			КонецЕсли;
		КонецЕсли; 
		
		Остаток =  Объект.Сумма;
		НомерМесяца = 0;
		Пока Остаток > 0 Цикл
			Строка			= Объект.График.Добавить();
			Строка.Период	= ДобавитьМесяц(Объект.ДатаНачала,НомерМесяца);
			Сумма			= Мин(Остаток,ЕжемесячнаяСумма);
			строка.Сумма	= Сумма;
			Остаток			= Остаток - Сумма;
			НомерМесяца		= НомерМесяца + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.КолвоМесяцев = 12;
		Объект.ДатаНачала	= ТекущаяДатаСеанса();
	КонецЕсли;
	Элементы.КошелекКуда.Видимость = Объект.ЭтоПеревод;
КонецПроцедуры


&НаКлиенте
Процедура ЭтоПереводПриИзменении(Элемент)
	Элементы.КошелекКуда.Видимость = Объект.ЭтоПеревод;
КонецПроцедуры
